{
  "projects": [
    {
      "fromGithub": false,
      "label": "Machine Learning honours project",
      "excerpt": "In the last year of studies, I completed a Honours project. In this project I explored rebuilding an existing Neural Network to use less parameters on image datasets while keeping the same accuracy. ",
      "slug": "machine-learning-honours",
      "imgUrl": "https://i.imgur.com/bTcMR21.png",
      "rawMarkdown": "# Machine Learning Honours Project\n\n## Abstract\n\nOver the past few years, there has been a push to make neural networks larger and although this has many benefits, it can be difficult to run these neural networks on smaller devices with limited memory and CPU power. This thesis aims to show how one can refine volume preserving neural networks, increasing their accuracy on image data. This results in more accurate models or models that are smaller in terms of number of parameters. It will be shown that one can use spatial permutations to improve the accuracy of smaller and medium sized volume preserving neural networks and one is able to use this smaller network instead and thus reduce the number of parameters. Other techniques are explored such as Haar wavelets and pooling. It will also be shown how volume preserving neural networks can be used to make other neural networks smaller in terms of number of parameters. Replacing dense layers with VPNN layers was also tested and resulted in reducing certain CNNs by 19% with little or no loss in accuracy. Overall the goal is to show methods for improving volume preserving neural networks on image data and use volume preserving neural networks to decrease the number of parameters on other networks.\n\nPlease[ check out the publication](https://islandscholar.ca/islandora/object/ir%3A24114 \"Logan Anderson Honours Link\") if you are interested in learning more\n\n## Technology Used\n\n* Python\n* Tensorflow\n* Matplotlib\n* Linux servers with Large GPUs\n"
    },
    {
      "fromGithub": true,
      "label": "Crave of the day",
      "url": "https://raw.githubusercontent.com/logan-anderson/crave-of-the-day/master/README.md",
      "excerpt": "A website and twitter bot that generates and shows a new AI generated food recipe every day.",
      "slug": "crave-of-the-day",
      "imgUrl": "https://i.imgur.com/zfzik4c.png"
    },
    {
      "fromGithub": false,
      "label": "Disc Golf Club Rating and Scoring Web App",
      "excerpt": "A Disc golf scoring system that allows users to log in, create a club, add members, and score rounds with a custom rating system that I created. It also has a leaderboard that shows the top rated players in the club along with a history.",
      "slug": "dg-rating-app",
      "imgUrl": "https://i.imgur.com/MpyYHcG.png",
      "rawMarkdown": "# Disc Golf Online Rating System\n\nThis online rating system allows users to sign up, join a club and record disc golf rounds. Once a round is recorded the players are rated and put on a leaderboard. The leaderboard and rating is generated by using a a Bayesian approximation method that takes into account the skills of all players.\n\nThe Web app is built with Vite, React router, and uses fireship for the backend and database.\n"
    },
    {
      "fromGithub": true,
      "label": "This Blog",
      "excerpt": "This blog was made with React, Nextjs and TinaCMS. It pulls static data from Github and local json files at build time.",
      "slug": "blog",
      "imgUrl": "https://i.imgur.com/x7eUp15.png",
      "url": "https://raw.githubusercontent.com/logan-anderson/blog-nextjs-tina-tailwind/master/README.md",
      "rawMarkdown": ""
    },
    {
      "fromGithub": false,
      "label": "Disc Golf Disc API",
      "excerpt": "A simple rest API that displays up to date disc golf data, hosted on fly.io and can be accessed though rapidapi",
      "slug": "dg-api",
      "imgUrl": "https://i.imgur.com/gCTIctZ.png",
      "rawMarkdown": "# Disc Golf API\n\nThis API will allow you to search, all the discs that are currently available on the market. It will also be updated when new discs are approved by the PDGA. When new discs are approved by the PDGA, they will be added to this API and when disc golf flight numbers are not available, machine learning is used to predict what they will be.\n\nBuilt on express, it has rate limiting, cacheing and[ integration with rapidapi](https://rapidapi.com/loganderson55-kQiMtgko_ez/api/disc-golf-discs/).\n"
    },
    {
      "fromGithub": false,
      "label": "Twitter Bot for New Disc Golf Discs",
      "excerpt": "A twitter bot that posts when new discs are added to the PDGA site. It uses a custom machine learning model to accurately predict flight characteristics of new discs.",
      "slug": "dg-twitter-bot",
      "imgUrl": "https://i.imgur.com/f94evQN.png",
      "rawMarkdown": "# Disc Golf Twitter Bot\n\nWhen a new disc golf disc is approved for use in tournaments it is posted on the PDGA website. A cron job is setup to run every day that scapes the PDGA websites and checks for new discs. If a new disc is detected, the info is extracted and a post is made to twitter.\n\n## Machine learning\n\nA machine learning model (made  with tensorflow ) was trained on all existing discs in order to predict how the new one will fly. This info is also added to the tweet.\n\nSee the entire thing in action by[ looking at the twitter page](https://twitter.com/DiscsNew \"Discs New Twitter Page\").\n"
    },
    {
      "fromGithub": true,
      "label": "Full Stack List Management Web App",
      "excerpt": "Web app that lets users view, edit and delete notes. It also uses passport to allow users to log in, log out and make an account",
      "slug": "list-app",
      "imgUrl": "https://i.imgur.com/UF0K8ZX.png",
      "url": "https://raw.githubusercontent.com/logan-anderson/note-app/develop/README.md",
      "rawMarkdown": ""
    },
    {
      "fromGithub": true,
      "label": "Blog for Loretta Anderson",
      "excerpt": "A statically generated blog that uses Sanity, Next.js, React and SSR.",
      "slug": "loretta-blog",
      "imgUrl": "/img/loretta-blog.png",
      "url": "https://raw.githubusercontent.com/logan-anderson/loretta-blog/main/README.md",
      "rawMarkdown": ""
    },
    {
      "fromGithub": true,
      "label": "Competitive Programming",
      "excerpt": "A collection of my solutions of competitive programming problems on kattis",
      "slug": "competitive-programming",
      "url": "https://raw.githubusercontent.com/logan-anderson/competitive-programming/master/README.md",
      "rawMarkdown": ""
    }
  ]
}
